app/views/messages/_message.html.erb

  <td><%= message.location %></td>
  <td><%= message.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1