app/views/messages/new.mobile.erb

      <%= f.input :location %>
      <%= f.input :group, collection: current_user.groups, member_label: :name, include_blank: false %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC