app/views/incivents/_form_fields.html.erb

    <%= f.input :type, collection: @account.types.where(usage: Type::USAGES[:event_type]), member_label: :description, include_blank: false %>
    <%= f.input :group, label: 'Team', collection: current_user.groups, member_label: :name, include_blank: false %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC