app/views/incivents/_incivent.html.erb

  <% end %>
  <td><%= incivent.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1