app/views/incivents/_incivent_show_detail.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1
---
          <td class="listing-i-i">Group:</td>
          <td><%= @incivent.group.name %></td>