app/views/incivents/new.mobile.erb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
---
      <%= f.input :description %>
      <%= f.input :group, :collection => current_user.groups, :member_label => :name, :include_blank => false %>