app/views/tasks/_form_fields.html.erb

    <%= f.input :location, hint: "You must enter either an address OR latitude and longitude as decimal degrees" %>
    <%= f.input :group, label: 'Team', collection: current_user.groups, member_label: :name %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC