app/views/tasks/_task_show_detail.html.erb

          <td class="listing-i-i">Group:</td>
          <td><%= @task.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1