app/views/groups/_group_memberships.html.erb

  <td>
    <%= semantic_form_for @user.memberships.find_by_group_id(group), :html => { :method => :delete }, :remote => true do |f| %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = 1 AND "memberships"."group_id" = 1 LIMIT 1