app/views/groups/_group_show.html.erb

SELECT "incivents".* FROM "incivents" WHERE "incivents"."group_id" = 1
SELECT COUNT(*) FROM "incivents" WHERE "incivents"."group_id" = 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."group_id" = 1
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."group_id" = 1
SELECT "messages".* FROM "messages" WHERE "messages"."group_id" = 1
SELECT COUNT(*) FROM "messages" WHERE "messages"."group_id" = 1
---
        <td class="listing-i-fl"><%= group.description %></td>
        <td><%= group.incivents.count %></td>
        <td><%= group.tasks.count %></td>
        <td><%= group.messages.count %></td>

SELECT "updates".* FROM "updates" WHERE "updates"."group_id" = 1
SELECT COUNT(*) FROM "updates" WHERE "updates"."group_id" = 1
---
  <% end %>
  <% unless group.updates.empty? %>