app/controllers/accounts_controller.rb

  def index
    if signed_in? && current_user.god_user?
      @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def new
    if signed_in?
      flash[:error] = "You already have an account."
      redirect_to root_path
    else
      if params[:account_option]
       @account = Account.new(:account_option_id => AccountOption.find_by_name(params[:account_option]).id)
---
SELECT "account_options".* FROM "account_options" WHERE "account_options"."name" = 'Pro' LIMIT 1

  def edit
    if signed_in? && current_user.master_user?
      @account = current_user.account
    elsif current_user.god_user
      @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1

  def create
    @account = Account.new(params[:account])
    @account.toggle(:active)
    if @account.save
---
INSERT INTO "accounts" ("account_option_id", "active", "created_at", "name", "payment_active", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @account = Account.find(params[:id])
    # change_account = false
    # if @account.account_option != AccountOption.find(params[:account][:account_option_id])
    #   change_account = true
    # end
    if @account.update_attributes(params[:account])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
UPDATE "accounts" SET "account_option_id" = 1, "payment_active" = 'f', "updated_at" = '2014-01-27 10:10:00.052048' WHERE "accounts"."id" = 1

  def destroy
    account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1