app/controllers/account_options_controller.rb

SELECT "account_options".* FROM "account_options"
---
  def index
    @account_options = AccountOption.all

SELECT "account_options".* FROM "account_options" WHERE "account_options"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
   @account_option = AccountOption.find(params[:id])

SELECT "account_options".* FROM "account_options" WHERE "account_options"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "account_options" SET "name" = 'Test', "updated_at" = '2013-10-01 09:31:26.608926' WHERE "account_options"."id" = 1
---
  def update
    @account_option = AccountOption.find(params[:id])
    if @account_option.update_attributes(params[:account_option])