app/controllers/admin_groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."account_id" = 1 ORDER BY groups.created_at DESC
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."account_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
	@account = current_user.account
	@groups = @account.groups
	@user = @account.users.find(params[:user_id])