app/controllers/groups_controller.rb

  def index
    if current_user.master_user?
      @groups = current_user.account.groups
    else
      @groups = current_user.groups
    end
    @ids_for_earth = []
    @groups.each { |group| @ids_for_earth << group.id unless group.incivents.unarchived.count == 0 && group.tasks.unarchived.count == 0 && group.stories.unarchived.count == 0 && group.measurements.unarchived.count == 0 }
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".id FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
SELECT COUNT(*) FROM "incivents" WHERE "incivents"."group_id" = 1
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."group_id" = 1

  def update
    @account = current_user.account
    @group = @account.groups.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."account_id" = 1 AND "groups"."id" = ? ORDER BY groups.created_at DESC LIMIT 1  [["id", "1"]]