app/controllers/incivents_controller.rb

  def show
    @account = current_user.account
    if (current_user.master_user? && current_user.account == Incivent.find(params[:id]).group.account ) || @account.account_incivents.incivents_from_groups_joined_by(current_user).find_by(id: params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".id FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
SELECT "incivents".* FROM "incivents" WHERE "incivents"."id" = ? AND (group_id IN (1) OR raised_user_id = 1) LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    if (current_user.master_user? && current_user.account == Incivent.find(params[:id]).group.account ) || current_user.incivents.find_by(id: params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
SELECT "incivents".* FROM "incivents" WHERE "incivents"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @account = current_user.account
    @incivent = current_user.incivents.build(params[:incivent])
    group = @incivent.group
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC

  def update
    @account = current_user.account
    @incivent = @account.account_incivents.incivents_from_groups_joined_by(current_user).find(params[:id])
    group = @incivent.group
    if @incivent.update_attributes(params[:incivent])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".id FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
SELECT "incivents".* FROM "incivents" WHERE "incivents"."id" = ? AND (group_id IN (1) OR raised_user_id = 1) LIMIT 1  [["id", "1"]]
UPDATE "incivents" SET "incivent_image_file_name" = 'AttackImage.png', "incivent_image_content_type" = 'image/png', "incivent_image_file_size" = 326957, "incivent_image_updated_at" = '2013-08-19 14:06:17.540718', "location" = '174 Longmarket Street, Cape Town 8000, South Africa', "updated_at" = '2013-08-19 14:06:20.232140' WHERE "incivents"."id" = 1