app/controllers/invitations_controller.rb

  def new
    if signed_in? #&& !current_user.god_user
      if current_user.master_user?
        @invitation = Invitation.new(account_id: current_user.account.id)
      else
        flash[:notice] = "Invites can only be sent by the account master user."
        redirect_to root_path
      end
    else
      # This is for completely new signups, i.e. not done by the admin user.
      if params[:account_id]
        @account = Account.find(params[:account_id])
        if @account && @account.users.count == 0
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT COUNT(*) FROM "users" WHERE "users"."account_id" = 2