app/controllers/launch_interests_controller.rb

  def index
    @launch_interests = LaunchInterest.all
---
SELECT "launch_interests".* FROM "launch_interests" ORDER BY launch_interests.created_at DESC