app/controllers/memberships_controller.rb

INSERT INTO "memberships" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 17 Feb 2014 23:38:37 SAST +02:00], ["group_id", 1], ["updated_at", Mon, 17 Feb 2014 23:38:37 SAST +02:00], ["user_id", 2]]
---
  def create
    @membership = Membership.new(params[:membership])
    @membership.save