app/controllers/messages_controller.rb

  def edit
    @account = current_user.account
    @message = @account.account_messages.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]

  def show
    @account = current_user.account
    @message = @account.account_messages.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @message = current_user.messages.build(params[:message])
    group = @message.group
    if @message.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1
INSERT INTO "messages" ("archive", "created_at", "description", "group_id", "latitude", "location", "longitude", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @account = current_user.account
    @message = @account.account_messages.find(params[:id])
    group = @message.group
    if @message.update_attributes(params[:message])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "messages" SET "description" = 'Customer raved about us! I am on my way to the next delivery. Yakety bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla ', "updated_at" = '2013-08-26 20:36:49.188030' WHERE "messages"."id" = 1