app/controllers/priorities_controller.rb

  def index
    @priorities = current_user.account.priorities.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "priorities".* FROM "priorities" WHERE "priorities"."account_id" = 1