app/controllers/statuses_controller.rb

  def index
    @statuses = current_user.account.statuses.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "statuses".* FROM "statuses" WHERE "statuses"."account_id" = 1