app/controllers/subscriptions_controller.rb

UPDATE "accounts" SET "payment_active" = 't', "updated_at" = '2013-10-21 09:05:40.722714' WHERE "accounts"."id" = 1
---
  def activate
    @activation_code = params[:activation][:code]
    if @activation_code.match(/\A[a-z][1-9][A-Z]+[a-z]{3}[1-9]+[a-z]\z/)
      if current_user.master_user
        account = current_user.account
        account.toggle(:payment_active)