app/controllers/tasks_controller.rb

  def new
    @account = current_user.account
    @task = Task.new(:raised_user_id => current_user.id)
    @users = @account.users.all
---
SELECT "users".* FROM "users" WHERE "users"."account_id" = 1

  def bulk_new
    @account = current_user.account
    @group = @account.groups.find(params[:group_id])
    10.times { @group.tasks.new(:raised_user_id => current_user.id) }
    @users = @account.users.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = 1 ORDER BY groups.created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    @account = current_user.account
    @task = @account.account_tasks.find(params[:id])
    @group = @task.group
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".id FROM "groups" WHERE "groups"."account_id" = 1 ORDER BY groups.created_at DESC
SELECT "tasks".* FROM "tasks" WHERE "tasks"."group_id" IN (1) AND "tasks"."id" = ? LIMIT 1  [["id", "2"]]

  def show
    @account = current_user.account
    @task = @account.account_tasks.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @account = current_user.account
    @task = Task.new(params[:task])
    group = @task.group
    @users = @account.users.all
    if @task.save
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."account_id" = 1
INSERT INTO "tasks" ("assigned_user_id", "complete", "created_at", "description", "due_date", "group_id", "latitude", "location", "longitude", "priority_id", "raised_user_id", "status_id", "task_image_content_type", "task_image_file_name", "task_image_file_size", "task_image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def bulk_create
    @account = current_user.account
    @group = @account.groups.find(params[:group_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."account_id" = 1 AND "groups"."id" = ? ORDER BY groups.created_at DESC LIMIT 1  [["id", "1"]]

  def update
    @account = current_user.account
    @task = @account.account_tasks.find(params[:id])
    group = @task.group
    if @task.update_attributes(params[:task])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".id FROM "groups" WHERE "groups"."account_id" = 1 ORDER BY groups.created_at DESC
SELECT "tasks".* FROM "tasks" WHERE "tasks"."group_id" IN (1) AND "tasks"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tasks" SET "task_image_file_name" = 'ForestImage.png', "task_image_content_type" = 'image/png', "task_image_file_size" = 560177, "task_image_updated_at" = '2013-08-31 20:45:26.416453', "location" = '23 Lion Street, Cape Town 8001, South Africa', "updated_at" = '2013-08-31 20:45:28.426313' WHERE "tasks"."id" = 2

    task = account.account_tasks.find(params[:id])
    group = task.group
    if task.destroy
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 ORDER BY groups.created_at DESC LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]