app/controllers/types_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "types".* FROM "types" WHERE "types"."account_id" = 1
---
  def index
    @types = current_user.account.types.all