app/controllers/users_controller.rb

  def index
    if current_user.master_user?
      @users = current_user.account.users.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."account_id" = 1

  def edit
    @account = current_user.account
    if current_user.master_user?
      @user = @account.users.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."account_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", "1"]]