app/views/accounts/_account.html.erb

  	<div class="listing-i-f"><%= account.active %></div>
  	<div class="listing-i-fs"><%= account.users.count %></div>
  	<div class="listing-i-fs"><%= account.groups.count %></div>
  	<div class="listing-i-fs"><%= account.account_incivents.count %></div>
---
SELECT COUNT(*) FROM "users" WHERE "users"."account_id" = 1
SELECT "groups".id FROM "groups" WHERE "groups"."account_id" = 1 ORDER BY groups.created_at DESC
SELECT COUNT(*) FROM "groups" WHERE "groups"."account_id" = 1
SELECT "accounts".* FROM "accounts"